# Datasets Task

In this compulsory task you will use pandas to select data from a dataset and explain the data retrieved for a given line of code.

In [10]:
# Import library pandas
import pandas as pd

You will use the same `balance.txt` dataset used in the example Jupyter notebook. Remember to ensure it is in the same folder as this notebook.

In [28]:
# Load data from local file directory
df = pd.read_csv('balance.txt',sep=' ')
# Print all columns, useful later in tasks
print(df.columns)

Index(['Balance', 'Income', 'Limit', 'Rating', 'Cards', 'Age', 'Education',
       'Gender', 'Student', 'Married', 'Ethnicity'],
      dtype='object')

1. Write the code that performs the action described in the following statements.

In [29]:
# Select the 'Limit' and 'Rating' columns for the first five observations
df_selected = df[['Limit','Rating']]
df_selected.head()

   Limit  Rating
0   3606     283
1   6645     483
2   7075     514
3   9504     681
4   4897     357

In [17]:
# Select the first five observations with 4 cards
df_selected = df[df['Cards'] == 4]
df_selected.head()

,Balance,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity
2,22.530409,104.593,7075,514,4,71,11,Male,No,No,Asian
5,22.486178,80.180,8047,569,4,77,10,Male,No,No,Caucasian
10,13.994990,63.095,8117,589,4,30,14,Male,No,Yes,Caucasian
20,9.853100,17.700,2860,235,4,63,16,Female,No,No,Asian
29,14.007770,26.813,5611,411,4,55,16,Female,No,No,Caucasian

In [22]:
# Sort the observations by 'Education'. Show users with a high education value first.
df.sort_values(by='Education',ascending=False).head(10)

,Balance,Income,Limit,Rating,Cards,Age,Education,Gender,Student,Married,Ethnicity
60,13.297283,35.510,5198,364,2,35,20,Female,No,No,Asian
51,13.010768,39.705,3969,301,2,27,20,Male,No,Yes,African American
378,10.140785,19.349,4941,366,1,33,19,Male,No,Yes,Caucasian
247,13.774598,36.364,2220,188,3,50,19,Male,No,No,Caucasian
238,11.079748,26.532,2910,236,6,58,19,Female,No,Yes,Caucasian
215,13.234385,41.025,4229,337,3,79,19,Female,No,Yes,Caucasian
213,8.158463,39.422,5245,383,2,44,19,Male,No,No,African American
9,17.756965,71.061,6819,491,3,41,19,Female,Yes,Yes,African American
131,6.302923,10.726,1568,162,5,46,19,Male,No,Yes,Asian
109,8.080534,13.561,3261,279,5,37,19,Male,No,Yes,Asian

2. Write a short explanation in the form of a comment for the following lines of code. For example:  
```
# Selects the first 5 rows, and all of the columns for those rows.
df.iloc[:5,:]
```

In [ ]:
# Shows all rows and coloumns
df.iloc[:,:]

In [ ]:
# View selects from 6th column and 6th row and prints rest of the data
df.iloc[5:,5:]

In [ ]:
# Shows all the records from the first column
df.iloc[:,0]

In [ ]:
# Shows all the columns for 10th row
df.iloc[9,:]